Improved Highlevel architecture diagram
